Revit 2024 API
RibbonItem.ItemType Property
Gets the item type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public RibbonItemType ItemType { get; }
Visual Basic
Public ReadOnly Property ItemType As RibbonItemType
	Get
Visual C++
public:
property RibbonItemType ItemType {
	RibbonItemType get ();
}
See Also
RibbonItem Class
Autodesk.Revit.UI Namespace